Revit 2017 API
StructuralSectionPipeStandard Class
 Defines parameters for pipes also known as RoundHSS or HollowStructuralSection (HSS).
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2015
Syntax
C#
public class StructuralSectionPipeStandard : StructuralSectionRound
Visual Basic
Public Class StructuralSectionPipeStandard _
	Inherits StructuralSectionRound
Visual C++
public ref class StructuralSectionPipeStandard : public StructuralSectionRound
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRound
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionPipeStandard
See Also
StructuralSectionPipeStandard Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace